app/controllers/tabs_controller.rb

  def index
      @tabs = Tab.paginate :per_page => 10, :page => params[:page],
                           :conditions => ['(title LIKE ? OR tag LIKE ?) AND user_id LIKE ?', "%#{params[:search]}%", "%#{params[:search]}%", "%#{params[:user_id]}%"],
                           :order => params[:order_by]
---
SELECT * FROM `tabs`

  def show
    @tab = Tab.find(params[:id])
---
SELECT * FROM `tabs` WHERE (`tabs`.`id` = 1)

  def edit
    if current_user
      if current_user.id == Tab.find(params[:id]).user_id
---
SELECT * FROM `tabs` WHERE (`tabs`.`id` = 1)
SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1

  def create
    @tab = Tab.new(params[:tab])
    @tab.user_id = current_user.id

    respond_to do |format|
      if @tab.save
---
INSERT INTO `tabs` (`artist`, `created_at`, `title`, `updated_at`, `tag`, `user_id`, `tab`) VALUES('Madness', '2010-07-31 16:06:48', 'Нэг өдөр', '2010-07-31 16:06:48', 'Madness, Мэднэс, Маднэс, Монгол, Mongolian', 1, 'Artist: Madness\r\nTitle: Neg udur\r\nTabbed by: djmo54\r\n\r\n\r\nUsed chords:\r\n\r\nA 002220\r\nAmaj7 002120\r\nA7 002020\r\nF# 244322\r\nBm 224432\r\nE 022100\r\nD 000232\r\n\r\nIntro:\r\n\r\ne|------------|\r\nB|---2---0----|\r\nG|-----2---2--| x2\r\nD|------------|\r\nA|------------|\r\nE|------------|\r\n\r\n\r\nA Amaj7\r\nChi namaig orhiod garlaa\r\nA7 F# Bm\r\nUruund seruu tatlaa\r\nF# Bm E\r\nHairt mine yawbal yawdaa\r\n\r\n\r\nTsonhon deer yalaa suulaa\r\nTsonhnii tsaana boroo shaagilaa\r\nChi mine daarwal yana daa\r\n\r\n A Bm D\r\nHuleene bi chamaigaa huleene\r\n E A\r\nSetgel zownin baij huleene\r\n Bm D \r\nBi chamaigaa huleene\r\n E A\r\nOdorjin bodoj huleene\r\n\r\n\r\nBi chinii araas garlaa\r\nSereed hartal gertee bailaa\r\nYawmaar sanagdlaa\r\n\r\nHundgan deer yalaa suulaa\r\nUdalgui sogtood unlaa\r\nZalhuu yalaaa\r\n\r\n A Bm D\r\nHuleene bi chamaigaa huleene\r\n E A\r\nSetgel zownin baij huleene\r\n Bm D \r\nBi chamaigaa huleene\r\n E A\r\nOdorjin bodoj huleene\r\n\r\n^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\r\n Have fun! :D\r\n^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^')

  def update
    @tab = Tab.find(params[:id])
---
SELECT * FROM `tabs` WHERE (`tabs`.`id` = 1)

  def destroy
    if current_user
      @tab = Tab.find(params[:id])
      @tab.destroy
---
SELECT * FROM `tabs` WHERE (`tabs`.`id` = 2)
DELETE FROM `tabs` WHERE `id` = 2